## Veri Çercevesi / DataFrame

In [3]:
import pandas as pd
import numpy as np

In [7]:
data = np.random.randn(4,3)

In [9]:
data

array([[ 0.11484666,  0.03164821, -0.51659866],
       [-0.78720268, -1.63924478, -0.54576043],
       [ 0.8819134 ,  0.43636041, -1.52154582],
       [-0.50147032,  0.20033524, -0.84745817]])

In [11]:
dataFrame = pd.DataFrame(data)

In [13]:
dataFrame

          0         1         2
0  0.114847  0.031648 -0.516599
1 -0.787203 -1.639245 -0.545760
2  0.881913  0.436360 -1.521546
3 -0.501470  0.200335 -0.847458

In [15]:
dataFrame[0] #ilk COLUMN

0    0.114847
1   -0.787203
2    0.881913
3   -0.501470
Name: 0, dtype: float64

In [17]:
type(dataFrame[0])

pandas.core.series.Series

In [19]:
yeniDataFrame = pd.DataFrame(data,index=["atıl","zeynep","atlas","mehmet"],columns = ["maas","yas","çalışma suresi"])

In [21]:
yeniDataFrame

            maas       yas  çalışma suresi
atıl    0.114847  0.031648       -0.516599
zeynep -0.787203 -1.639245       -0.545760
atlas   0.881913  0.436360       -1.521546
mehmet -0.501470  0.200335       -0.847458

In [23]:
yeniDataFrame["yas"]

atıl      0.031648
zeynep   -1.639245
atlas     0.436360
mehmet    0.200335
Name: yas, dtype: float64

In [27]:
yeniDataFrame[["maas","yas"]]

            maas       yas
atıl    0.114847  0.031648
zeynep -0.787203 -1.639245
atlas   0.881913  0.436360
mehmet -0.501470  0.200335

In [29]:
yeniDataFrame.loc["atıl"] # etiket odaklı satır çekiyor

maas              0.114847
yas               0.031648
çalışma suresi   -0.516599
Name: atıl, dtype: float64

In [31]:
yeniDataFrame.iloc[2] # index odaklı satır çekiyor

maas              0.881913
yas               0.436360
çalışma suresi   -1.521546
Name: atlas, dtype: float64

In [33]:
yeniDataFrame.iloc[1:3]

            maas       yas  çalışma suresi
zeynep -0.787203 -1.639245       -0.545760
atlas   0.881913  0.436360       -1.521546

In [35]:
yeniDataFrame

            maas       yas  çalışma suresi
atıl    0.114847  0.031648       -0.516599
zeynep -0.787203 -1.639245       -0.545760
atlas   0.881913  0.436360       -1.521546
mehmet -0.501470  0.200335       -0.847458

In [37]:
yeniDataFrame["emeklilik yası"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]

In [39]:
yeniDataFrame

            maas       yas  çalışma suresi  emeklilik yası
atıl    0.114847  0.031648       -0.516599        0.063296
zeynep -0.787203 -1.639245       -0.545760       -3.278490
atlas   0.881913  0.436360       -1.521546        0.872721
mehmet -0.501470  0.200335       -0.847458        0.400670

In [45]:
yeniDataFrame.drop("çalışma suresi", axis = 1) #sutün

            maas       yas  emeklilik yası
atıl    0.114847  0.031648        0.063296
zeynep -0.787203 -1.639245       -3.278490
atlas   0.881913  0.436360        0.872721
mehmet -0.501470  0.200335        0.400670

In [47]:
yeniDataFrame.drop("mehmet", axis = 0) #satır

            maas       yas  çalışma suresi  emeklilik yası
atıl    0.114847  0.031648       -0.516599        0.063296
zeynep -0.787203 -1.639245       -0.545760       -3.278490
atlas   0.881913  0.436360       -1.521546        0.872721

In [49]:
yeniDataFrame #hiç bir şey değişmedi , değişmesi için kaydetmen gerekiyor

            maas       yas  çalışma suresi  emeklilik yası
atıl    0.114847  0.031648       -0.516599        0.063296
zeynep -0.787203 -1.639245       -0.545760       -3.278490
atlas   0.881913  0.436360       -1.521546        0.872721
mehmet -0.501470  0.200335       -0.847458        0.400670

In [51]:
yeniDataFrame.drop("emeklilik yası", axis = 1, inplace = True) # inplace ile kaydediyor

In [53]:
yeniDataFrame

            maas       yas  çalışma suresi
atıl    0.114847  0.031648       -0.516599
zeynep -0.787203 -1.639245       -0.545760
atlas   0.881913  0.436360       -1.521546
mehmet -0.501470  0.200335       -0.847458

In [57]:
yeniDataFrame.loc["atıl"]

maas              0.114847
yas               0.031648
çalışma suresi   -0.516599
Name: atıl, dtype: float64

In [59]:
yeniDataFrame.loc["atıl"]["maas"]

0.11484665515289286

In [63]:
yeniDataFrame.loc["atlas","yas"]

0.43636041038536005

In [65]:
yeniDataFrame

            maas       yas  çalışma suresi
atıl    0.114847  0.031648       -0.516599
zeynep -0.787203 -1.639245       -0.545760
atlas   0.881913  0.436360       -1.521546
mehmet -0.501470  0.200335       -0.847458

In [69]:
booleanFrame = yeniDataFrame < 0

In [71]:
booleanFrame

         maas    yas  çalışma suresi
atıl    False  False            True
zeynep   True   True            True
atlas   False  False            True
mehmet   True  False            True

In [73]:
yeniDataFrame[booleanFrame]

            maas       yas  çalışma suresi
atıl         NaN       NaN       -0.516599
zeynep -0.787203 -1.639245       -0.545760
atlas        NaN       NaN       -1.521546
mehmet -0.501470       NaN       -0.847458

In [75]:
yeniDataFrame[yeniDataFrame < 0 ]

            maas       yas  çalışma suresi
atıl         NaN       NaN       -0.516599
zeynep -0.787203 -1.639245       -0.545760
atlas        NaN       NaN       -1.521546
mehmet -0.501470       NaN       -0.847458

In [79]:
yeniDataFrame["yas"] > 0

atıl       True
zeynep    False
atlas      True
mehmet     True
Name: yas, dtype: bool

In [81]:
yeniDataFrame[yeniDataFrame["yas"] > 0]

            maas       yas  çalışma suresi
atıl    0.114847  0.031648       -0.516599
atlas   0.881913  0.436360       -1.521546
mehmet -0.501470  0.200335       -0.847458

In [83]:
yeniDataFrame

            maas       yas  çalışma suresi
atıl    0.114847  0.031648       -0.516599
zeynep -0.787203 -1.639245       -0.545760
atlas   0.881913  0.436360       -1.521546
mehmet -0.501470  0.200335       -0.847458

In [87]:
yeniDataFrame.reset_index(inplace = True)

In [89]:
yeniDataFrame

    index      maas       yas  çalışma suresi
0    atıl  0.114847  0.031648       -0.516599
1  zeynep -0.787203 -1.639245       -0.545760
2   atlas  0.881913  0.436360       -1.521546
3  mehmet -0.501470  0.200335       -0.847458

In [91]:
yeniIndexList = ["Ati","Zey","Atl","Meh"]

In [93]:
yeniDataFrame["Yeni Index"] = yeniIndexList

In [95]:
yeniDataFrame

    index      maas       yas  çalışma suresi Yeni Index
0    atıl  0.114847  0.031648       -0.516599        Ati
1  zeynep -0.787203 -1.639245       -0.545760        Zey
2   atlas  0.881913  0.436360       -1.521546        Atl
3  mehmet -0.501470  0.200335       -0.847458        Meh

In [99]:
yeniDataFrame.set_index("Yeni Index" , inplace = True)

In [101]:
yeniDataFrame

             index      maas       yas  çalışma suresi
Yeni Index
Ati           atıl  0.114847  0.031648       -0.516599
Zey         zeynep -0.787203 -1.639245       -0.545760
Atl          atlas  0.881913  0.436360       -1.521546
Meh         mehmet -0.501470  0.200335       -0.847458

In [103]:
yeniDataFrame.loc["Ati"]

index                 atıl
maas              0.114847
yas               0.031648
çalışma suresi   -0.516599
Name: Ati, dtype: object

## Multi index

In [110]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [112]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [114]:
birlesmisIndex = list(zip(ilkIndeksler,icIndeksler))

In [116]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [118]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [120]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [122]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [124]:
benimCizgiList = [[40,"A"],[30,"B"],[9,"C"],[32,"D"],[12,"E"],[876,"F"]]

In [126]:
cizginumpydizi = np.array(benimCizgiList)

In [128]:
cizginumpydizi

array([['40', 'A'],
       ['30', 'B'],
       ['9', 'C'],
       ['32', 'D'],
       ['12', 'E'],
       ['876', 'F']], dtype='<U21')

In [132]:
cizgiDataFrame = pd.DataFrame(cizginumpydizi,birlesmisIndex,columns = ["yas","meslek"])

In [134]:
cizgiDataFrame

                    yas meslek
Simpson    Homer     40      A
           Bart      30      B
           Marge      9      C
South Park Cartman   32      D
           Kenny     12      E
           Kyle     876      F

In [136]:
cizgiDataFrame.loc["Simpson"]

      yas meslek
Homer  40      A
Bart   30      B
Marge   9      C

In [140]:
cizgiDataFrame.loc["South Park"].loc["Kenny"]

yas       12
meslek     E
Name: Kenny, dtype: object

In [150]:
cizgiDataFrame

                    yas meslek
Simpson    Homer     40      A
           Bart      30      B
           Marge      9      C
South Park Cartman   32      D
           Kenny     12      E
           Kyle     876      F

In [152]:
cizgiDataFrame.index.names = ["çizgi film adı","karakter"]

In [154]:
cizgiDataFrame

                         yas meslek
çizgi film adı karakter
Simpson        Homer      40      A
               Bart       30      B
               Marge       9      C
South Park     Cartman    32      D
               Kenny      12      E
               Kyle      876      F